Revit 2024 API
TemporaryViewMode Enumeration
 Enumeration to represent the various temporary view modes a view can be in.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2012
Syntax
C#
public enum TemporaryViewMode
Visual Basic
Public Enumeration TemporaryViewMode
Visual C++
public enum class TemporaryViewMode
Members
Member name | Description
RevealHiddenElements |  The view is in reveal hidden elements mode
TemporaryHideIsolate |  The view is in temporary hide/isolate mode
WorksharingDisplay |  The view is in one of the worksharing display modes
TemporaryViewProperties |  The view is in the selected View Properties applied temporarily.
ExplodedView |  The view is in the mode that shows the model in exploded view and allows user changes/configurations
RevealConstraints |  The view is in the mode that reveals constraints between elements in the model.
PreviewFamilyVisibility |  The view is in the mode that shows visibility settings applied in the environment of a family document.
See Also
Autodesk.Revit.DB Namespace